[
  
  [
    "So, you think you can take on the goblin king?",
    "Well. You can't.",
    "But the people seem to have sort of taken a liking to you.",
    "Not like they have me, of course. But a liking nonetheless.",
    "So I will give you one chance to dethrone me.",
    "Defeat my champions with nothing except this knife.",
    "If you can beat all of them, you will have proven yourself worthy of the throne",
    "And seriously, I mean NOTHING except this knife.",
    "Get naked."
  ],
  
  [
    "Oh please. That was just one measly fish.",
    "Let us see how you fare against FOUR measly fish!"
  ],
  
  [
    "Fine then. Fish won't do you in.",
    "How about one of my beautiful thoroughbreds then?"
  ],
  
  [
    "You're starting to make me mad."
  ],
  
  [
    "I hope you aren't scared of ghosts...",
    "Because, uh, one is gonna be shooting at you."
  ],
  
  [
    "HOW CAN YOU STAB A GHOST ANYWAY?!"
  ],
  
  [
    "Cowboys are pretty good with guns, right?",
    "I'm sure a cowboy can beat you easy."
  ],
  
  [
    "Cowboys and lasers, maybe?"
  ],
  
  [
    "I would like to retract my previous statement.",
    "Cowboys and lasers was, to put it simply, a silly concept.",
    "The past meeting the future in such a violent clash?",
    "I'm not above admitting it when I've made a mistake.",
    "What I should have done is just put lasers freaking everywhere."
  ],
  
  [
    "You're just making me look foolish now.",
    "I'm resorting to flowers.",
    "Can they even shoot guns?"
  ],
  
  [
    "And mushrooms."
  ],
  
  [
    "You're just fighting a whole freaking garden at this point.",
    "It's preposterous.",
    "Just die."
  ],
  
  [
    "You could not possibly kill ALL of these weird little guys..."
  ],
  
  [
    "Seriously, wouldn't you just LIKE to die now?"
  ],
  
  [
    "Hm.",
    "Well.",
    "It seems I have no more little minions, er, I mean, champions to throw at you.",
    "So be it.",
    "Nothing could possibly beat me and my precious golden gun."
  ],
  
  [
    "Now wait just a second!",
    "That wasn't a fair fight!",
    "You had a knife and I only got this dumb little gun!",
    "One more fight.",
    "But this time...",
    "We're equals."
  ]
  
]